; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l33_p33_c33_g33_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(crate-at crate32 depot)
	(crate-at crate33 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate food crate24)
	(content-crate food crate25)
	(content-crate food crate26)
	(content-crate food crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(content-crate medicine crate32)
	(content-crate medicine crate33)
	(person-at person1 loc5)
	(person-at person2 loc17)
	(person-at person3 loc6)
	(person-at person4 loc1)
	(person-at person5 loc7)
	(person-at person6 loc4)
	(person-at person7 loc13)
	(person-at person8 loc24)
	(person-at person9 loc32)
	(person-at person10 loc18)
	(person-at person11 loc20)
	(person-at person12 loc13)
	(person-at person13 loc23)
	(person-at person14 loc13)
	(person-at person15 loc30)
	(person-at person16 loc22)
	(person-at person17 loc16)
	(person-at person18 loc10)
	(person-at person19 loc16)
	(person-at person20 loc28)
	(person-at person21 loc1)
	(person-at person22 loc10)
	(person-at person23 loc28)
	(person-at person24 loc30)
	(person-at person25 loc16)
	(person-at person26 loc22)
	(person-at person27 loc14)
	(person-at person28 loc9)
	(person-at person29 loc22)
	(person-at person30 loc17)
	(person-at person31 loc33)
	(person-at person32 loc14)
	(person-at person33 loc32)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person24 food)
	(has-content-person person24 medicine)
	(has-content-person person25 medicine)
	(has-content-person person26 food)
	(has-content-person person28 medicine)
	(has-content-person person29 food)
	(has-content-person person30 food)
	(has-content-person person31 food)
))
)

; plan
1. (pick-up-crate crate33 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate33 depot)
   added: (has-crate-drone-arm drone1 right crate33)
   goals met: 1 of 34
2. (pick-up-crate crate27 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate27 depot)
   added: (has-crate-drone-arm drone1 left crate27)
   goals met: 1 of 34
3. (drone-move depot loc33 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc33)
   goals met: 0 of 34
4. (drop-crate loc33 person31 crate27 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate27)
   added: (has-content-person person31 food) (empty-arm drone1 left)
   goals met: 1 of 34
5. (drone-move loc33 depot drone1)
   deleted: (drone-at drone1 loc33)
   added: (drone-at drone1 depot)
   goals met: 2 of 34
6. (pick-up-crate crate26 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate26 depot)
   added: (has-crate-drone-arm drone1 left crate26)
   goals met: 2 of 34
7. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 1 of 34
8. (drop-crate loc32 person9 crate26 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate26)
   added: (has-content-person person9 food) (empty-arm drone1 left)
   goals met: 2 of 34
9. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 3 of 34
10. (pick-up-crate crate25 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate25 depot)
   added: (has-crate-drone-arm drone1 left crate25)
   goals met: 3 of 34
11. (drone-move depot loc24 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc24)
   goals met: 2 of 34
12. (drop-crate loc24 person8 crate25 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate25)
   added: (has-content-person person8 food) (empty-arm drone1 left)
   goals met: 3 of 34
13. (drone-move loc24 depot drone1)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 depot)
   goals met: 4 of 34
14. (pick-up-crate crate24 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate24 depot)
   added: (has-crate-drone-arm drone1 left crate24)
   goals met: 4 of 34
15. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 3 of 34
16. (drop-crate loc20 person11 crate24 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate24)
   added: (has-content-person person11 food) (empty-arm drone1 left)
   goals met: 4 of 34
17. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 5 of 34
18. (pick-up-crate crate23 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate23 depot)
   added: (has-crate-drone-arm drone1 left crate23)
   goals met: 5 of 34
19. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 4 of 34
20. (drop-crate loc18 person10 crate23 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate23)
   added: (has-content-person person10 food) (empty-arm drone1 left)
   goals met: 5 of 34
21. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 6 of 34
22. (pick-up-crate crate22 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate22 depot)
   added: (has-crate-drone-arm drone1 left crate22)
   goals met: 6 of 34
23. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 5 of 34
24. (drop-crate loc10 person22 crate22 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate22)
   added: (has-content-person person22 food) (empty-arm drone1 left)
   goals met: 6 of 34
25. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 7 of 34
26. (pick-up-crate crate21 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate21 depot)
   added: (has-crate-drone-arm drone1 left crate21)
   goals met: 7 of 34
27. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 6 of 34
28. (drop-crate loc9 person28 crate33 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate33)
   added: (has-content-person person28 medicine) (empty-arm drone1 right)
   goals met: 7 of 34
29. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 8 of 34
30. (pick-up-crate crate32 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate32 depot)
   added: (has-crate-drone-arm drone1 right crate32)
   goals met: 8 of 34
31. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 7 of 34
32. (drop-crate loc7 person5 crate21 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate21)
   added: (has-content-person person5 food) (empty-arm drone1 left)
   goals met: 8 of 34
33. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 9 of 34
34. (pick-up-crate crate20 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate20 depot)
   added: (has-crate-drone-arm drone1 left crate20)
   goals met: 9 of 34
35. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 8 of 34
36. (drop-crate loc6 person3 crate20 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate20)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 9 of 34
37. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 10 of 34
38. (pick-up-crate crate19 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate19 depot)
   added: (has-crate-drone-arm drone1 left crate19)
   goals met: 10 of 34
39. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 9 of 34
40. (drop-crate loc5 person1 crate19 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate19)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 10 of 34
41. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 11 of 34
42. (pick-up-crate crate18 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate18 depot)
   added: (has-crate-drone-arm drone1 left crate18)
   goals met: 11 of 34
43. (drone-move depot loc30 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc30)
   goals met: 10 of 34
44. (drop-crate loc30 person15 crate18 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate18)
   added: (has-content-person person15 food) (empty-arm drone1 left)
   goals met: 11 of 34
45. (drone-move loc30 depot drone1)
   deleted: (drone-at drone1 loc30)
   added: (drone-at drone1 depot)
   goals met: 12 of 34
46. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate17 depot)
   added: (has-crate-drone-arm drone1 left crate17)
   goals met: 12 of 34
47. (drone-move depot loc30 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc30)
   goals met: 11 of 34
48. (drop-crate loc30 person24 crate17 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate17)
   added: (has-content-person person24 food) (empty-arm drone1 left)
   goals met: 12 of 34
49. (drop-crate loc30 person24 crate32 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate32)
   added: (has-content-person person24 medicine) (empty-arm drone1 right)
   goals met: 13 of 34
50. (drone-move loc30 depot drone1)
   deleted: (drone-at drone1 loc30)
   added: (drone-at drone1 depot)
   goals met: 14 of 34
51. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate31 depot)
   added: (has-crate-drone-arm drone1 right crate31)
   goals met: 14 of 34
52. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate16 depot)
   added: (has-crate-drone-arm drone1 left crate16)
   goals met: 14 of 34
53. (drone-move depot loc28 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc28)
   goals met: 13 of 34
54. (drop-crate loc28 person20 crate16 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate16)
   added: (has-content-person person20 food) (empty-arm drone1 left)
   goals met: 14 of 34
55. (drone-move loc28 depot drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 depot)
   goals met: 15 of 34
56. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 left crate15)
   goals met: 15 of 34
57. (drone-move depot loc28 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc28)
   goals met: 14 of 34
58. (drop-crate loc28 person23 crate15 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate15)
   added: (has-content-person person23 food) (empty-arm drone1 left)
   goals met: 15 of 34
59. (drone-move loc28 depot drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 depot)
   goals met: 16 of 34
60. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 left crate14)
   goals met: 16 of 34
61. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 15 of 34
62. (drop-crate loc23 person13 crate14 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate14)
   added: (has-content-person person13 food) (empty-arm drone1 left)
   goals met: 16 of 34
63. (drop-crate loc23 person13 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate31)
   added: (has-content-person person13 medicine) (empty-arm drone1 right)
   goals met: 17 of 34
64. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 18 of 34
65. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate30 depot)
   added: (has-crate-drone-arm drone1 right crate30)
   goals met: 18 of 34
66. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 left crate13)
   goals met: 18 of 34
67. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 17 of 34
68. (drop-crate loc22 person16 crate13 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate13)
   added: (has-content-person person16 food) (empty-arm drone1 left)
   goals met: 18 of 34
69. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 19 of 34
70. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 left crate12)
   goals met: 19 of 34
71. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 18 of 34
72. (drop-crate loc22 person26 crate12 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate12)
   added: (has-content-person person26 food) (empty-arm drone1 left)
   goals met: 19 of 34
73. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 20 of 34
74. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 20 of 34
75. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 19 of 34
76. (drop-crate loc22 person29 crate11 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person29 food) (empty-arm drone1 left)
   goals met: 20 of 34
77. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 21 of 34
78. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 21 of 34
79. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 20 of 34
80. (drop-crate loc17 person2 crate10 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person2 food) (empty-arm drone1 left)
   goals met: 21 of 34
81. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 22 of 34
82. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 22 of 34
83. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 21 of 34
84. (drop-crate loc17 person30 crate9 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person30 food) (empty-arm drone1 left)
   goals met: 22 of 34
85. (drop-crate loc17 person2 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate30)
   added: (has-content-person person2 medicine) (empty-arm drone1 right)
   goals met: 23 of 34
86. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 24 of 34
87. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate29 depot)
   added: (has-crate-drone-arm drone1 right crate29)
   goals met: 24 of 34
88. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 24 of 34
89. (drone-move depot loc16 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc16)
   goals met: 23 of 34
90. (drop-crate loc16 person17 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person17 food) (empty-arm drone1 left)
   goals met: 24 of 34
91. (drone-move loc16 depot drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 depot)
   goals met: 25 of 34
92. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 25 of 34
93. (drone-move depot loc16 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc16)
   goals met: 24 of 34
94. (drop-crate loc16 person19 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person19 food) (empty-arm drone1 left)
   goals met: 25 of 34
95. (drop-crate loc16 person25 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate29)
   added: (has-content-person person25 medicine) (empty-arm drone1 right)
   goals met: 26 of 34
96. (drone-move loc16 depot drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 depot)
   goals met: 27 of 34
97. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate28 depot)
   added: (has-crate-drone-arm drone1 right crate28)
   goals met: 27 of 34
98. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 27 of 34
99. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 26 of 34
100. (drop-crate loc4 person6 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate28)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 27 of 34
101. (drop-crate loc4 person6 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person6 food) (empty-arm drone1 left)
   goals met: 28 of 34
102. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 29 of 34
103. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 29 of 34
104. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 29 of 34
105. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 28 of 34
106. (drop-crate loc13 person7 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person7 food) (empty-arm drone1 left)
   goals met: 29 of 34
107. (drop-crate loc13 person12 crate5 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person12 food) (empty-arm drone1 right)
   goals met: 30 of 34
108. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 31 of 34
109. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 31 of 34
110. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 30 of 34
111. (drop-crate loc13 person14 crate3 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person14 food) (empty-arm drone1 right)
   goals met: 31 of 34
112. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 32 of 34
113. (pick-up-crate crate2 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 right crate2)
   goals met: 32 of 34
114. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 32 of 34
115. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 31 of 34
116. (drop-crate loc1 person4 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person4 food) (empty-arm drone1 left)
   goals met: 32 of 34
117. (drop-crate loc1 person21 crate2 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate2)
   added: (has-content-person person21 food) (empty-arm drone1 right)
   goals met: 33 of 34
118. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 34 of 34
